In [1]:
import pandas as pd

In [3]:
dataframe = pd.read_csv('datos/daily-total-female-births-CA.csv',header =0)

In [4]:
dataframe.head()

         date  births
0  1959-01-01      35
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44

In [5]:
dataframe['date'].dtype

dtype('O')

In [6]:
df2 = pd.read_csv('datos/daily-total-female-births-CA.csv',header =0,parse_dates=[0])

In [7]:
df2.head()

        date  births
0 1959-01-01      35
1 1959-01-02      32
2 1959-01-03      30
3 1959-01-04      31
4 1959-01-05      44

In [8]:
df2['date'].dtype

dtype('<M8[ns]')